NextFOAM-2506/tutorials/multiphase/compressibleInterIsoFoam/laminar/depthCharge2D/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field alpha.water;
type composedFunction;
mode subtract;
composedFunction
{
    plane
    {
        type plane;
        origin (0 1. 0);
        normal (0 -1 0);
    }

    sphere
    {
        type cylinder;
        radius 0.1;
        origin (0.5 0.5 0);
        direction (0 0 1);
        scale -1;
    }
}


// ************************************************************************* //
